7767517
145 174
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_49                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_50                  1 1 3 4
Convolution              conv_4                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_51                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_5                   1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_52                  1 1 12 13
Convolution              conv_6                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_53                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_7                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_54                  1 1 18 19
Convolution              conv_8                   1 1 19 20 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_55                  1 1 20 21
Convolution              conv_9                   1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_56                  1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_10                  1 1 28 29 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_57                  1 1 29 30
Convolution              conv_11                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_58                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_12                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_59                  1 1 37 38
Convolution              conv_13                  1 1 38 39 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_60                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Concat                   cat_1                    4 1 24 26 34 41 42 0=0
Convolution              conv_14                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_61                  1 1 43 44
Split                    splitncnn_3              1 2 44 45 46
Convolution              conv_15                  1 1 46 47 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_62                  1 1 47 48
Convolution              conv_16                  1 1 48 49 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_63                  1 1 49 50
Slice                    split_2                  1 2 50 51 52 -23300=2,64,64 1=0
Split                    splitncnn_4              1 3 52 53 54 55
Convolution              conv_17                  1 1 55 56 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_64                  1 1 56 57
Convolution              conv_18                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_65                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Split                    splitncnn_5              1 3 60 61 62 63
Convolution              conv_19                  1 1 63 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_66                  1 1 64 65
Convolution              conv_20                  1 1 65 66 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_67                  1 1 66 67
BinaryOp                 add_4                    2 1 62 67 68 0=0
Concat                   cat_2                    4 1 51 53 61 68 69 0=0
Convolution              conv_21                  1 1 69 70 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_68                  1 1 70 71
Convolution              conv_22                  1 1 71 72 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Split                    splitncnn_6              1 2 72 73 74
Pooling                  maxpool2d_46             1 1 74 75 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_7              1 2 75 76 77
Pooling                  maxpool2d_47             1 1 77 78 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_8              1 2 78 79 80
Pooling                  maxpool2d_48             1 1 80 81 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_3                    4 1 73 76 79 81 82 0=0
Convolution              conv_23                  1 1 82 83 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_69                  1 1 83 84
Split                    splitncnn_9              1 2 84 85 86
Interp                   upsample_87              1 1 86 87 0=1 1=2.0 2=2.0 6=0
Concat                   cat_4                    2 1 87 45 88 0=0
Convolution              conv_24                  1 1 88 89 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_70                  1 1 89 90
Slice                    split_3                  1 2 90 91 92 -23300=2,32,32 1=0
Split                    splitncnn_10             1 2 92 93 94
Convolution              conv_25                  1 1 94 95 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_71                  1 1 95 96
Convolution              conv_26                  1 1 96 97 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_72                  1 1 97 98
Concat                   cat_5                    3 1 91 93 98 99 0=0
Convolution              conv_27                  1 1 99 100 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_73                  1 1 100 101
Split                    splitncnn_11             1 3 101 102 103 104
Convolution              conv_28                  1 1 104 105 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_74                  1 1 105 106
Concat                   cat_6                    2 1 106 85 107 0=0
Convolution              conv_29                  1 1 107 108 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_75                  1 1 108 109
Slice                    split_4                  1 2 109 110 111 -23300=2,64,64 1=0
Split                    splitncnn_12             1 2 111 112 113
Convolution              conv_30                  1 1 113 114 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_76                  1 1 114 115
Convolution              conv_31                  1 1 115 116 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_77                  1 1 116 117
Concat                   cat_7                    3 1 110 112 117 118 0=0
Convolution              conv_32                  1 1 118 119 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_78                  1 1 119 120
Split                    splitncnn_13             1 2 120 121 122
MemoryData               pnnx_65                  0 1 123 0=3380
Convolution              conv_33                  1 1 103 124 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_79                  1 1 124 125
Convolution              conv_34                  1 1 125 126 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_80                  1 1 126 127
Convolution              conv_35                  1 1 127 128 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_88               1 1 128 129 0=2704 1=64
Convolution              conv_36                  1 1 122 130 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_81                  1 1 130 131
Convolution              conv_37                  1 1 131 132 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_82                  1 1 132 133
Convolution              conv_38                  1 1 133 134 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_89               1 1 134 135 0=676 1=64
Concat                   cat_8                    2 1 129 135 136 0=1
Convolution              conv_39                  1 1 102 137 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_83                  1 1 137 138
Convolution              conv_40                  1 1 138 139 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_84                  1 1 139 140
Convolution              conv_41                  1 1 140 141 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
Reshape                  reshape_90               1 1 141 142 0=2704 1=2
Convolution              conv_42                  1 1 121 143 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_85                  1 1 143 144
Convolution              conv_43                  1 1 144 145 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_86                  1 1 145 146
Convolution              conv_44                  1 1 146 147 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
Reshape                  reshape_91               1 1 147 148 0=676 1=2
Concat                   cat_9                    2 1 142 148 149 0=1
Reshape                  reshape_92               1 1 136 150 0=3380 1=16 2=4
Permute                  transpose_95             1 1 150 151 0=2
Softmax                  softmax_1                1 1 151 152 0=0 1=1
Convolution              conv_45                  1 1 152 153 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_93               1 1 153 154 0=3380 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 155 0=3380 1=2
Split                    splitncnn_0              1 2 155 156 157
Slice                    chunk_0                  1 2 154 158 159 -23300=2,-233,-233 1=0
BinaryOp                 sub_5                    2 1 156 158 160 0=1
Split                    splitncnn_14             1 2 160 161 162
BinaryOp                 add_6                    2 1 157 159 163 0=0
Split                    splitncnn_15             1 2 163 164 165
BinaryOp                 add_7                    2 1 161 164 166 0=0
BinaryOp                 div_8                    1 1 166 167 0=3 1=1 2=2.0
BinaryOp                 sub_9                    2 1 165 162 168 0=1
Concat                   cat_10                   2 1 167 168 169 0=0
Reshape                  reshape_94               1 1 123 170 0=3380 1=1
BinaryOp                 mul_10                   2 1 169 170 171 0=2
Sigmoid                  sigmoid_0                1 1 149 172
Concat                   cat_11                   2 1 171 172 out0 0=0
